{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "meta-llama/Llama-2-13b-chat-hf",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 2,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.39.self_attn.q_proj",
    "model.layers.39.self_attn.k_proj",
    "model.layers.39.self_attn.o_proj",
    "model.layers.39.self_attn.v_proj",
    "model.layers.39.mlp.down_proj",
    "model.layers.39.mlp.gate_proj",
    "model.layers.39.mlp.up_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_rslora": false
}